package Operating;

public class Task {
    //Разработка системы, реализующей планировщик очереди.
    //Существует процесс, генерирующий заявки различной вычилительной длины (выраженной в секундах)
    // и имеющий различный приоритет. Существует процесс обработчик, который читает заявки из очереди
    // и обрабатывает их в соответствии с заданными параметрами длины. Существует процесс - планировщик
    // очереди. Его задача: при поступлении очередной заявки переупорядочить очередь в соответствии
    // с приоритетами. Очередь должна находиться в разделяемой памяти.
}